# Brewfile for homebrew-bundle
# Run `brew bundle` to install homebrew packages.
# see https://github.com/Homebrew/homebrew-bundle

# taps
tap "homebrew/versions"
tap "caskroom/versions"

# brew-cask
brew "caskroom/cask/brew-cask"

# Packages
brew "autoconf"
brew "cairo"
brew "cmake"
brew "jemalloc"
brew "libyaml"
brew "openssl"
brew "pkg-config"
brew "readline"

brew "go"
brew "lua"

brew "elasticsearch"
brew "mariadb"
brew "memcached"
brew "nginx"
brew "redis", args: ["with-jemalloc"]
brew "sqlite"

brew "ag"
brew "ctags"
brew "direnv"
brew "ghq"
brew "git"
brew "gnu-time"
brew "httpie"
brew "jq"
brew "macvim", args: ["with-lua"]
brew "mecab"
brew "mecab-ipadic"
brew "nkf"
brew "peco"
brew "tcpflow"
brew "tig"
brew "tmux"
brew "tree"
brew "vim", args: ["with-lua"]
brew "wget"
brew "zsh"
brew "zsh-completions"

# .dmg
cask "appcleaner"
cask "google-chrome"
cask "google-japanese-ime"
cask "imageoptim"
cask "iterm2"
cask "java"
