# Brewfile for homebrew-bundle
# Run `brew bundle` to install homebrew packages.
# see https://github.com/Homebrew/homebrew-bundle

# taps
tap "homebrew/versions"
tap "caskroom/versions"

# Packages
brew "autoconf"
brew "automake"
brew "cairo"
brew "cmake"
brew "jemalloc"
brew "libyaml"
brew "openssl"
brew "pkg-config"
brew "readline"

brew "go"
brew "lua"
brew "node"

brew "elasticsearch"
brew "percona-server"
brew "redis", args: ["with-jemalloc"]
brew "sqlite"

brew "docker"
brew "docker-machine"

brew "ag"
brew "clang-format"
brew "ctags"
brew "direnv"
brew "ghq"
brew "git"
brew "glide"
brew "gnu-time"
brew "jq"
brew "mecab"
brew "mecab-ipadic"
brew "nkf"
brew "peco"
brew "tig"
brew "tmux"
brew "tree"
brew "vim", args: ["with-lua"]
brew "wget"
brew "zsh"
brew "zsh-completions"

# .dmg
cask "appcleaner"
cask "iterm2"
cask "java"
