# Brewfile for homebrew-bundle
# Run `brew bundle` to install homebrew packages.
# see https://github.com/Homebrew/homebrew-bundle

# Packages
brew "autoconf"
brew "automake"
brew "cmake"
brew "jemalloc"
brew "libyaml"
brew "openssl"
brew "pkg-config"
brew "readline"

brew "go"
brew "lua"
brew "node"

brew "mariadb"
brew "redis", args: ["with-jemalloc", "HEAD"]
brew "sqlite"

brew "ag"
brew "clang-format"
brew "ctags"
brew "direnv"
brew "ghq"
brew "git"
brew "gnu-time"
brew "jq"
brew "mecab"
brew "mecab-ipadic"
brew "nkf"
brew "peco"
brew "percona-toolkit"
brew "tig"
brew "tmux"
brew "tree"
brew "vim", args: ["with-lua"]
brew "wget"
brew "zsh"
brew "zsh-completions"
